# Project 3 - Part 3 (Core)

## Assignment [[Link]](https://login.codingdojo.com/m/376/12533/88095)

<p>The project assignment is at the beginning of this week because you already have all of the background to complete project part 3 based on the first two weeks of the course!</p>
<h2>Business Problem</h2>
<blockquote>
For this project, you have been hired to produce a MySQL database on Movies from a subset of IMDB's publicly available dataset. Ultimately, you will use this database to analyze what makes a movie successful, and will provide recommendations to the stakeholder on how to make a successful movie.</blockquote>
<p><img src="https://thesenatortheatre.com/wp-content/themes/senatortheatre/images_opt/theatre-background-color.jpg" width="50%"></p>
<h2>Part 3</h2>
<blockquote>
<strong>For part 3 of the project you will be practicing  applying an E.T.L process on your previously saved movie data. Specifically, you will create a new MySQL database after preparing the data for a relational database.&nbsp; You will export your database to a .sql file in your repository using MySQL Workbench.</strong></blockquote>
<h3>Specifications  - Database</h3>
<ul>
<li>
<p><strong>Your stakeholder wants you to take the data you have been cleaning and collecting in Parts 1 &amp; 2 of the project, and wants you to create a MySQL database for them.</strong></p>
</li>
<li>
<p>You should normalize the tables as best you can before adding them to your new database.</p>
<ul>
<li>Note: an important exception to their request is that they would like you to keep all of the data from the TMDB API in 1 table together (even though it will not be perfectly normalized).&nbsp;&nbsp;</li><li>You only need to keep the imdb_id, revenue, budget, and certification columns</li>
</ul>
</li>
</ul>
<h4>Required Transformation steps:</h4>
<ul>
<li>
<p><strong>Normalize Genre:</strong></p>
<ul>
<li>Convert the single string of genres from title basics into 2 new tables.
<ol>
<li>
<p><code>title_genres</code>:  with the columns:</p>
<ul>
<li>tconst</li>
<li>genre_id</li>
</ul>
</li>
<li>
<p><code>genres</code>:</p>
<ul>
<li>genre_id</li>
<li>genre_name</li>
</ul>
</li>
</ol>
</li>
</ul>
</li>
<li>
<p><strong>Discard unnecessary information:</strong></p>
<ul>
<li>For the <code>title basics</code> table, drop the following columns:
<ul>
<li>"original_title" (we will use the primary title column instead)</li>
<li>"isAdult" ("Adult" will show up in the genres so this is redundant information).</li>
<li>"titleType" (every row will be a movie).</li>
<li>"genres" and other variants of genre (genre is now represented in the 2 new tables described above.</li>
</ul>
</li>
<li>Do not include the <code>title_akas</code> table in your SQL database.
<ul>
<li>You have already filtered out the desired movies using this table and the remaining data is mostly nulls and not of-interest to the stakeholder.</li>
</ul>
</li>
</ul>
</li>
</ul>
<h4>MySQL Database Requirements</h4>
<ul>
<li>
<p>Use sqlalchemy with pandas to execute your SQL queries inside your notebook.</p>
</li>
<li>
<p>Create a new database on your MySQL server and  call it "movies".</p>
</li>
<li>
<p>Make sure to have the following tables in your "movies" database:</p>
<ul>
<li><code>title_basics</code></li>
<li><code>title_ratings</code></li>
<li><code>title_genres</code></li>
<li><code>genres</code></li>
<li><code>tmdb_data</code></li>
</ul>
</li>
<li>
<p>Make sure to set a Primary Key for each table.</p>
</li>
<li>
<p>After creating each table, show the first 5 rows of that table using a SQL query.</p>
</li>
<li>
<p>Make sure to run the "SHOW TABLES" SQL query at the end of your notebook to show that all required tables have been created.</p></li>
</ul>
<h2>Deliverables</h2><p>Submit a link to your github respository containing the Jupyter Notebook file.</p><p><br></p><h2>Getting Started Tips</h2>
<h2>Normalizing Genres - Overview</h2>
<ul>
<li>
<p>In order to normalize genres, we will need to:</p>
<ul>
<li>Convert the single string of genres from title basics into 2 new tables.
<ol>
<li>
<p><code>title_genres</code>:  with the columns:</p>
<ul>
<li>tconst</li>
<li>genre_id</li>
</ul>
</li>
<li>
<p><code>genres</code>:</p>
<ul>
<li>genre_id</li>
<li>genre_name</li>
</ul>
</li>
</ol>
</li>
</ul>
</li>
<li>
<p>Creating these tables will be a multi-step process.</p>
<ol>
<li>Getting a list of all individual genres.</li>
<li>Create a new <code>title_genres</code> table with with the movie ids duplicated, once for each genre that a movie belongs to.</li>
<li>Create a mapper dictionary with numeric ids for each genre.</li>
<li>Use the mapper dictionary to replace the string genres in <code>title_genres</code> with numeric genre_ids.</li>
<li>Convert the mapper dictionary into a final <code>genres</code> table with the numeric genre_id and the string genre.</li>
</ol>
</li>
</ul>
<h3>1. Getting List of Unique Genres</h3>
<ul>
<li>
<p><strong>The genres column should be separated into separate genres.</strong></p>
<ul>
<li>For example: "Comedy,Fantasy,Romance" is actually 3 genres that the movie belongs to, not one combined-genre.</li>
</ul>
</li>
<li>
<p><strong>First, you will need to get a list of all of the unique genres that appear in the column.</strong> Right now, the genre column contains a string with the genres separated by a comma.</p>
<ol>
<li>We are going to convert these strings into lists of strings into a new 'genres_split' column.</li>
</ol>
<pre data-language="python"><span class="comment">## create a col with a list of genres</span>
df[<span class="string">'genres_split'</span>] <span class="keyword operator">=</span> df[<span class="string">'genre'</span>].str.<span class="function call">split</span>(<span class="string">','</span>)
df
<button class="copy_code_snippet_btn">copy</button></pre>
<figure><img src="https://s3.us-east-1.amazonaws.com/General_V88/boomyeah2015/codingdojo/curriculum/content/chapter/1649210222__split_genres.png"></figure><p><br></p>
<ol start="2">
<li>We will then use  <code>.explode()</code> to separate the list of genres into new rows: one row for each genre a movie belonged to.</li>
</ol>
<pre data-language=" rainbow  language-python">exploded_genres = df.explode('genres_split')
exploded_genres
<button class="copy_code_snippet_btn">copy</button></pre>
<figure><img src="https://s3.us-east-1.amazonaws.com/General_V88/boomyeah2015/codingdojo/curriculum/content/chapter/1649210253__genres_explode.png"></figure><p><br></p>
<ol start="3">
<li>Finally, use .unique() to get the unique genres from the <code>genres_split</code> column.
<ul>
<li>We can run this through <code>sorted</code> function to get the genres sorted alphabetically.</li>
<li>Save this list of unique genres. We will use it again in a later step.</li>
</ul>
</li>
</ol>
<pre data-language="python">unique_genres <span class="keyword operator">=</span> <span class="support function python">sorted</span>(exploded_genres[<span class="string">'genres_split'</span>].<span class="function call">unique</span>())
<button class="copy_code_snippet_btn">copy</button></pre>
</li>
</ul>
<h3>2. Create a new <code>title_genres</code> table</h3>
<ul>
<li>
<p>Next, create a new <code>title_genres</code> from the exploded df.</p>
<ul>
<li>We only want the tconst and genres_split columns.</li>
</ul>
<figure><img src="https://s3.us-east-1.amazonaws.com/General_V88/boomyeah2015/codingdojo/curriculum/content/chapter/1649210274__title_genres.png" style="width: 647px; height: 264px;" width="647" height="264"></figure><p><br></p>
</li>
</ul>
<h3>3. Create a genre mapper dictionary to replace string genres with integers</h3>
<ul>
<li>Next, we want to use the approach for creating a numeric id that we introduced in the advanced transformations with pandas lesson.
<ul>
<li>Reminder: we will use the <code>dict</code> and <code>zip</code> functions to make a dictionary with the genre strings as the keys and the integers genre_ids as the values.</li>
</ul>
</li>
</ul>
<pre data-language="python"><span class="comment">## Making the genre mapper dictionary</span>
genre_ints <span class="keyword operator">=</span> <span class="support function python">range</span>(<span class="support function python">len</span>(unique_genres))
genre_map <span class="keyword operator">=</span> <span class="support function python">dict</span>(<span class="support function python">zip</span>(unique_genres, genre_ints))
genre_map
<button class="copy_code_snippet_btn">copy</button></pre>
<figure><img src="https://s3.us-east-1.amazonaws.com/General_V88/boomyeah2015/codingdojo/curriculum/content/chapter/1649210292__genre_map.png" style="width: 743px; height: 510px;" width="743" height="510"></figure>
<p><br></p>
<h3>4. Replace the string genres in <code>title_genres</code> with the new integer ids.</h3>
<ul>
<li>Create a new <code>genre_id</code> column using the <code>genre_map</code> dictionary with either .map or .replace.</li>
<li>Next, drop the "genres_split" column.</li>
<li>Your <code>title_genres</code> table is now ready for your MySQL database!</li>
</ul>
<pre data-language="python"><span class="comment">## make new integer genre_id and drop string genres</span>
df[<span class="string">'genre_id'</span>] <span class="keyword operator">=</span> df[<span class="string">'genres_split'</span>].<span class="support function python">map</span>(genre_map)
df <span class="keyword operator">=</span> df.<span class="function call">drop</span>(columns<span class="keyword operator">=</span><span class="string">'genres_split'</span>)
<button class="copy_code_snippet_btn">copy</button></pre>
<h3>5. Convert the genre map dictionary into a dataframe.</h3>
<ul>
<li>There are several ways to do this. Here is one suggested approach:</li>
</ul>
<figure><img src="https://s3.us-east-1.amazonaws.com/General_V88/boomyeah2015/codingdojo/curriculum/content/chapter/1649210315__genre_lookup.png"></figure>
<p><br></p>
<ul>
<li>Now your <code>genres</code> table is all set for your MySQL database!</li>
</ul>
<h2>Saving the MySQL tables with <code>tconst</code> as the primary key.</h2>
<ul>
<li><strong>You will need to make sure to set the Primary Key</strong> for each table that you create with  pandas + sqlalchemy.
<ul>
<li>If we had an <code>integer</code> id columns, this would be as simple as:</li>
</ul>
<pre data-language="python"><span class="comment">## Set the dataframe index and use index=True </span>
df.<span class="function call">set_index</span>(<span class="string">'int_index'</span>).<span class="function call">to_sql</span>(<span class="string">'table_name'</span>,engine,index<span class="keyword operator">=</span><span class="constant language">True</span>)
<button class="copy_code_snippet_btn">copy</button></pre>
<ul>
<li>Because we have a string column ("tconst") as the primary key for several tables, we will need to go through some extra steps.</li>
<li>If we do not perform these steps (detailed below) approach, we would run into the following error:&nbsp;<figure><img src="https://s3.us-east-1.amazonaws.com/General_V88/boomyeah2015/codingdojo/curriculum/content/chapter/1649210356__primary_key_error.png" style="width: 792px; height: 70px;" width="792" height="70"></figure></li>
</ul>
</li>
</ul>
<h3>Using <code>tconst</code> as the primary key.</h3>
<ul>
<li>To use a string column as our primary key, we will need to provide the SQL datatype schema of our columns when we create the table.
<ul>
<li>We will then use our <code>engine</code> to run the command to alter our table and add tconst as the primary key.</li>
</ul>
</li>
</ul>
<h4>1. Creating a dataype schema for <code>to_sql</code>:</h4>
<ul>
<li>
<p><strong>Check the dtypes of your dataframe: (df.dtypes).</strong></p>
<ul>
<li>Create a dictionary with each column name as a key and the corresponding SQL datatype as the value.</li>
</ul>
</li>
<li>
<p><strong>Find the corresponding SQLalchemy datatype to use in the table below.</strong></p>
</li>
</ul>
<table>
<thead>
<tr>
<th>Pandas DataType</th>
<th>SQLAlchemy DataType</th>
</tr>
</thead>
<tbody>
<tr>
<td>int</td>
<td>Integer()</td>
</tr>
<tr>
<td>float</td>
<td>Float()</td>
</tr>
<tr>
<td>bool</td>
<td>Boolean()</td>
</tr>
<tr>
<td>object (for Primary Keys)</td>
<td>String(max_str_len+1)</td>
</tr>
<tr>
<td>object (for non-key columns)</td>
<td>Text(max_str_len+1)</td>
</tr>
</tbody>
</table>
<ul>
<li>
<p>Note on String Columns:</p>
<ul>
<li>For columns with "object" dtype, you should use:
<ul>
<li>the String type if the column will become your primary key.</li>
<li>Otherwise, use the Text datatpye.</li>
<li>Both String/Text will need the maximum string length to use for that column.</li>
</ul>
</li>
</ul>
</li>
<li>
<p><strong>You can find the maximum string length  (<code>max_str_len</code>) for any text column using the following code:</strong></p>
</li>
</ul>
<pre data-language="python"><span class="comment">## get max string length</span>
max_str_len <span class="keyword operator">=</span> df[<span class="string">'column'</span>].<span class="function call">fillna</span>(<span class="string">''</span>).<span class="support function python">map</span>(len).<span class="support function python">max</span>()
<button class="copy_code_snippet_btn">copy</button></pre>
<p>- Then Use 1 larger than the max_str_len for your String/Text object `Text(max_str_len +1 )`.</p>
<p>
</p>
<pre data-language="python"><span class="comment">## Example</span>
<span class="keyword">from</span> sqlalchemy.types <span class="keyword">import</span> <span class="keyword operator">*</span>
<span class="comment">## Calculate max string lengths for object columns</span>
key_len <span class="keyword operator">=</span> basics[<span class="string">'tconst'</span>].<span class="function call">fillna</span>(<span class="string">''</span>).<span class="support function python">map</span>(len).<span class="support function python">max</span>()
title_len <span class="keyword operator">=</span> basics[<span class="string">'primaryTitle'</span>].<span class="function call">fillna</span>(<span class="string">''</span>).<span class="support function python">map</span>(len).<span class="support function python">max</span>()
<span class="comment">## Create a schema dictonary using Sqlalchemy datatype objects</span>
df_schema <span class="keyword operator">=</span> {
    <span class="string">"tconst"</span>: <span class="keyword">String</span>(key_len<span class="keyword operator">+</span><span class="constant numeric">1</span>), 
    <span class="string">"primaryTitle"</span>: <span class="function call">Text</span>(title_len<span class="keyword operator">+</span><span class="constant numeric">1</span>),
    <span class="string">'startYear'</span>:<span class="keyword">Float</span>(),
    <span class="string">'endYear'</span>:<span class="keyword">Float</span>(),
    <span class="string">'runtimeMinutes'</span>:<span class="keyword">Integer</span>()}
<button class="copy_code_snippet_btn">copy</button></pre>
<h4>2. Run <code>df.to_sql</code> with the dtype argument.</h4>
<ul>
<li><strong>Use this dictionary as the <code>dtype</code> argument in <code>df.to_sql</code> (make sure <code>index=False</code>)</strong></li>
</ul>
<pre data-language="python"><span class="comment"># Save to sql with dtype and index=False</span>
basics.<span class="function call">to_sql</span>(<span class="string">'title_basics'</span>,engine,dtype<span class="keyword operator">=</span>df_schema,if_exists<span class="keyword operator">=</span><span class="string">'replace'</span>,index<span class="keyword operator">=</span><span class="constant language">False</span>)
<button class="copy_code_snippet_btn">copy</button></pre>
<h4>3. Run the query to ADD PRIMARY KEY</h4>
<ul>
<li><strong>Finally, use the sqlalchemy engine to update the table and set the desired column as the primary key</strong></li>
</ul>
<pre data-language="python">engine.<span class="function call">execute</span>(<span class="string">'ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);'</span>)
<button class="copy_code_snippet_btn">copy</button></pre>
        
        
        
        
        
        </div></div>

# Solution

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
import os,json
import missingno as ms

plt.rcParams['figure.facecolor'] = 'white'

pd.set_option('display.max_columns',100)

In [2]:
## Folder to save IMDB files
FOLDER = "Data/"
# os.makedirs(FOLDER,exist_ok=True)
sorted(os.listdir(FOLDER))

['.DS_Store',
 'final_tmdb_data_2000.csv.gz',
 'final_tmdb_data_2001.csv.gz',
 'final_tmdb_data_2002.csv.gz',
 'final_tmdb_data_2003.csv.gz',
 'final_tmdb_data_2004.csv.gz',
 'final_tmdb_data_2005.csv.gz',
 'final_tmdb_data_2006.csv.gz',
 'final_tmdb_data_2007.csv.gz',
 'final_tmdb_data_2008.csv.gz',
 'final_tmdb_data_2009.csv.gz',
 'final_tmdb_data_2010.csv.gz',
 'final_tmdb_data_2011.csv.gz',
 'final_tmdb_data_2012.csv.gz',
 'final_tmdb_data_2013.csv.gz',
 'final_tmdb_data_2014.csv.gz',
 'final_tmdb_data_2015.csv.gz',
 'final_tmdb_data_2016.csv.gz',
 'final_tmdb_data_2017.csv.gz',
 'final_tmdb_data_2018.csv.gz',
 'final_tmdb_data_2019.csv.gz',
 'final_tmdb_data_2020.csv.gz',
 'final_tmdb_data_2021.csv.gz',
 'title_akas_cleaned.csv.gz',
 'title_basics_cleaned.csv.gz',
 'title_ratings_cleaned.csv.gz',
 'tmdb_api_results_2000.json',
 'tmdb_api_results_2001.json',
 'tmdb_api_results_2002.json',
 'tmdb_api_results_2003.json',
 'tmdb_api_results_2004.json',
 'tmdb_api_results_2005.json',
 'tmdb_api_results_2006.json',
 'tmdb_api_results_2007.json',
 'tmdb_api_results_2008.json',
 'tmdb_api_results_2009.json',
 'tmdb_api_results_2010.json',
 'tmdb_api_results_2011.json',
 'tmdb_api_results_2012.json',
 'tmdb_api_results_2013.json',
 'tmdb_api_results_2014.json',
 'tmdb_api_results_2015.json',
 'tmdb_api_results_2016.json',
 'tmdb_api_results_2017.json',
 'tmdb_api_results_2018.json',
 'tmdb_api_results_2019.json',
 'tmdb_api_results_2020.json',
 'tmdb_api_results_2021.json']

## Extract: Loading Previous Data

### Title Basics

In [3]:
## title basics
basics = pd.read_csv(f'{FOLDER}title_basics_cleaned.csv.gz',low_memory=False)
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79248 entries, 0 to 79247
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79248 non-null  object
 1   titleType       79248 non-null  object
 2   primaryTitle    79248 non-null  object
 3   originalTitle   79248 non-null  object
 4   isAdult         79248 non-null  int64
 5   startYear       79248 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79248 non-null  int64
 8   genres          79248 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.4+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,movie,Grizzly II: Revenge,Grizzly II: The Predator,0,2020.0,NaN,74,"Horror,Music,Thriller"

### Title Ratings

In [4]:
## title ratings
ratings = pd.read_csv(f"{FOLDER}/title_ratings_cleaned.csv.gz",low_memory=False)
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 469805 entries, 0 to 469804
Data columns (total 3 columns):
 #   Column         Non-Null Count   Dtype
---  ------         --------------   -----
 0   tconst         469805 non-null  object
 1   averageRating  469805 non-null  float64
 2   numVotes       469805 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 10.8+ MB

      tconst  averageRating  numVotes
0  tt0000001            5.7      1879
1  tt0000002            5.9       248
2  tt0000005            6.2      2476
3  tt0000006            5.2       165
4  tt0000007            5.4       771

### TMDB API Results

- Students should have combined the years 2000 and 2001 as part of Part 2. I forgot to do so so I am doing here

In [5]:
## INSTRUCTOR CODE (not taught to students)
import glob
q = f"{FOLDER}final*.csv.gz"
files = glob.glob(q)
files

['Data/final_tmdb_data_2006.csv.gz',
 'Data/final_tmdb_data_2018.csv.gz',
 'Data/final_tmdb_data_2014.csv.gz',
 'Data/final_tmdb_data_2008.csv.gz',
 'Data/final_tmdb_data_2016.csv.gz',
 'Data/final_tmdb_data_2004.csv.gz',
 'Data/final_tmdb_data_2020.csv.gz',
 'Data/final_tmdb_data_2000.csv.gz',
 'Data/final_tmdb_data_2012.csv.gz',
 'Data/final_tmdb_data_2010.csv.gz',
 'Data/final_tmdb_data_2002.csv.gz',
 'Data/final_tmdb_data_2019.csv.gz',
 'Data/final_tmdb_data_2007.csv.gz',
 'Data/final_tmdb_data_2015.csv.gz',
 'Data/final_tmdb_data_2021.csv.gz',
 'Data/final_tmdb_data_2017.csv.gz',
 'Data/final_tmdb_data_2009.csv.gz',
 'Data/final_tmdb_data_2005.csv.gz',
 'Data/final_tmdb_data_2001.csv.gz',
 'Data/final_tmdb_data_2013.csv.gz',
 'Data/final_tmdb_data_2011.csv.gz',
 'Data/final_tmdb_data_2003.csv.gz']

In [6]:
## INSTRUCTOR CODE (not taught to students)
df = pd.concat([pd.read_csv(f, lineterminator='\n') for f in files])
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60152 entries, 0 to 1265
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                60152 non-null  object
 1   adult                  60130 non-null  float64
 2   backdrop_path          36994 non-null  object
 3   belongs_to_collection  3738 non-null   object
 4   budget                 60130 non-null  float64
 5   genres                 60130 non-null  object
 6   homepage               14776 non-null  object
 7   id                     60130 non-null  float64
 8   original_language      60130 non-null  object
 9   original_title         60130 non-null  object
 10  overview               58761 non-null  object
 11  popularity             60130 non-null  float64
 12  poster_path            54382 non-null  object
 13  production_companies   60130 non-null  object
 14  production_countries   60130 non-null  object
 15  release_date           59078 non-null  object
 16  revenue                60130 non-null  float64
 17  runtime                59298 non-null  float64
 18  spoken_languages       60130 non-null  object
 19  status                 60130 non-null  object
 20  tagline                22079 non-null  object
 21  title                  60130 non-null  object
 22  video                  60130 non-null  float64
 23  vote_average           60130 non-null  float64
 24  vote_count             60130 non-null  float64
 25  certification          14624 non-null  object
dtypes: float64(9), object(17)
memory usage: 12.4+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0144280,0.0,NaN,NaN,100000.0,[],NaN,30356.0,en,Whispers from a Shallow Grave,"When a beautiful photo model disappears, polic...",1.176,/cjRqAh3u2Z0MBx9GtT1k7Z9732w.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",1997-01-01,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Whispers from a Shallow Grave,0.0,2.0,2.0,NaN
2,tt0197633,0.0,/1hGrzTajJ5JC6VfPzrUj8Gj5t5k.jpg,NaN,0.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,58520.0,en,Live Freaky Die Freaky,It is the year 3069 and the Earth has been rob...,3.131,/3QKPZ9SzMcBdqkKdSitQbmRqB2l.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",2006-01-31,0.0,75.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Live Freaky Die Freaky,0.0,3.8,8.0,NR
3,tt0204250,0.0,/qKiOZMJH9Riqlk2SkUOgSMZHHJu.jpg,NaN,0.0,"[{'id': 9648, 'name': 'Mystery'}, {'id': 35, '...",NaN,459563.0,en,Death of a Saleswoman,Top-ranking RubberTubber saleswoman Agatha J. ...,0.600,/tIfllOpkhZl5sbqZd1X77iiaJDj.jpg,"[{'id': 90905, 'logo_path': None, 'name': 'Gir...","[{'iso_3166_1': 'US', 'name': 'United States o...",2006-09-18,0.0,77.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,6 housewives. 1 dead body. A trunk full of pla...,Death of a Saleswoman,0.0,3.0,1.0,NaN
4,tt0206634,0.0,/z8FzomPxfCb2nv827VWLSI6oYiB.jpg,NaN,76000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",http://www.universalstudiosentertainment.com/c...,9693.0,en,Children of Men,"In 2027, in a chaotic world in which humans ca...",19.318,/k9IAS4TehZFcKi4HVByxZNPfqex.jpg,"[{'id': 33, 'logo_path': '/8lvHyhjr8oUKOOy2dKX...","[{'iso_3166_1': 'GB', 'name': 'United Kingdom'...",2006-09-22,70595464.0,109.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The future's a thing of the past.,Children of Men,0.0,7.6,5779.0,R

In [7]:
## Dropping Placeholder rows with id=0
df = df.loc[ df['imdb_id']!='0']
df

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0144280,0.0,NaN,NaN,100000.0,[],NaN,30356.0,en,Whispers from a Shallow Grave,"When a beautiful photo model disappears, polic...",1.176,/cjRqAh3u2Z0MBx9GtT1k7Z9732w.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",1997-01-01,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Whispers from a Shallow Grave,0.0,2.0,2.0,NaN
2,tt0197633,0.0,/1hGrzTajJ5JC6VfPzrUj8Gj5t5k.jpg,NaN,0.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,58520.0,en,Live Freaky Die Freaky,It is the year 3069 and the Earth has been rob...,3.131,/3QKPZ9SzMcBdqkKdSitQbmRqB2l.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",2006-01-31,0.0,75.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Live Freaky Die Freaky,0.0,3.8,8.0,NR
3,tt0204250,0.0,/qKiOZMJH9Riqlk2SkUOgSMZHHJu.jpg,NaN,0.0,"[{'id': 9648, 'name': 'Mystery'}, {'id': 35, '...",NaN,459563.0,en,Death of a Saleswoman,Top-ranking RubberTubber saleswoman Agatha J. ...,0.600,/tIfllOpkhZl5sbqZd1X77iiaJDj.jpg,"[{'id': 90905, 'logo_path': None, 'name': 'Gir...","[{'iso_3166_1': 'US', 'name': 'United States o...",2006-09-18,0.0,77.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,6 housewives. 1 dead body. A trunk full of pla...,Death of a Saleswoman,0.0,3.0,1.0,NaN
4,tt0206634,0.0,/z8FzomPxfCb2nv827VWLSI6oYiB.jpg,NaN,76000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",http://www.universalstudiosentertainment.com/c...,9693.0,en,Children of Men,"In 2027, in a chaotic world in which humans ca...",19.318,/k9IAS4TehZFcKi4HVByxZNPfqex.jpg,"[{'id': 33, 'logo_path': '/8lvHyhjr8oUKOOy2dKX...","[{'iso_3166_1': 'GB', 'name': 'United Kingdom'...",2006-09-22,70595464.0,109.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The future's a thing of the past.,Children of Men,0.0,7.6,5779.0,R
5,tt0244521,0.0,/4W53mm2nvOtiOuPNW2oiBm9pmUZ.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 80, 'nam...",NaN,9925.0,en,Funny Money,"Henry Perkins, a mild-mannered accountant, acc...",5.591,/oG3jWUZiDqqrdk3oKwPEkuwoN89.jpg,"[{'id': 110622, 'logo_path': None, 'name': 'FW...","[{'iso_3166_1': 'DE', 'name': 'Germany'}, {'is...",2006-01-01,0.0,98.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Henry Perkins accidentally trades briefcases w...,Funny Money,0.0,5.4,39.0,R
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1261,tt5896628,0.0,NaN,NaN,0.0,"[{'id': 80, 'name': 'Crime'}]",NaN,852950.0,en,Harlem's Beauty,"Steven, a white teen who moves from the suburb...",0.600,NaN,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",2003-05-21,0.0,95.0,[],Released,NaN,Harlem's Beauty,0.0,0.0,0.0,NaN
1262,tt6066786,0.0,NaN,NaN,0.0,"[{'id': 16, 'name': 'Animation'}]",NaN,262232.0,en,Tom and Jerry: Paws for a Holiday,Join Tom Cat and Jerry Mouse for the thrill of...,0.918,/5LvLUnjDvsEvvRoGHTBsHNBq3Jk.jpg,"[{'id': 113519, 'logo_path': '/wxcVGtJwKkElcCX...","[{'iso_3166_1': 'US', 'name': 'United States o...",2004-10-05,0.0,50.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Tom and Jerry: Paws for a Holiday,1.0,4.8,2.0,G
1263,tt6188222,0.0,NaN,NaN,0.0,[],NaN,365592.0,cn,絕種賤男之愛在三級的日子,Film director Wai asks gang leader Ball to inv...,2.491,/jmh5ceFCL45aqCvb8Rc8tkQS292.jpg,[],[],2003-12-23,0.0,110.0,"[{'english_name': 'Cantonese', 'iso_639_1': 'c...",Released,NaN,Crazy Scum: Adult Movies,0.0,4.0,48.0,NaN
1264,tt7246872,0.0,NaN,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 10751, '...",NaN,640680.0,en,Tokyo Bedoone Tavaghof,NaN,0.633,/764JbpPIGeApSheIj0v5WvAUpuk.jpg,[],"[{'iso_3166_1': 'IR', 'name': 'Iran'}]",2003-09-10,0.0,98.0,"[{'english_name': 'Persian', 'iso_639_1': 'fa'...",Released,NaN,"Tokyo, Non-Stop",0.0,0.0,0.0,NaN
1265,tt9641790,0.0,NaN,NaN,400.0,"[{'id': 27, 'name': 'Horror'}, {'id': 53, 'nam...",NaN,253999.0,en,Clearwater,A woman has been abducted by the Clearwater ki...,0.600,/nHGb9mGbU4Z1hjysxcmrKJO6BbH.jpg,"[{'id': 174685, 'logo_path': None, 'name': 'Li...",[],2003-06-10,0.0,60.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Clearwater,0.0,0.0,0.0,NaN

# Transform

## basics

- normalize and separate genre
- "original_title" (we will use the primary title column instead)
- "isAdult" ("Adult" will show up in the genres so this is redundant information).
- "titleType" (every row will be a movie).
- "genres" and other variants of genre (genre is now represented in the 2 new tables described above.

In [8]:
basics.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 79248 entries, 0 to 79247
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          79248 non-null  object
 1   titleType       79248 non-null  object
 2   primaryTitle    79248 non-null  object
 3   originalTitle   79248 non-null  object
 4   isAdult         79248 non-null  int64
 5   startYear       79248 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  79248 non-null  int64
 8   genres          79248 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 5.4+ MB

In [9]:
cols_to_drop = ['originalTitle','isAdult','titleType','endYear'] #endYear not req'd
basics = basics.drop(columns=cols_to_drop)
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi"
4,tt0093119,Grizzly II: Revenge,2020.0,74,"Horror,Music,Thriller"
...,...,...,...,...,...
79243,tt9914942,Life Without Sara Amat,2019.0,74,Drama
79244,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy"
79245,tt9916170,The Rehearsal,2019.0,51,Drama
79246,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller"
79247,tt9916362,Coven,2020.0,92,"Drama,History"

### Normalizing Genre

In [10]:
## Fill Missing Genres 
## Create a new column with the single-string genres as a list of strings
basics['genres_split'] = basics['genres'].str.split(',')
basics

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,[Drama]
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,[Drama]
3,tt0088751,The Naked Monster,2005.0,100,"Comedy,Horror,Sci-Fi","[Comedy, Horror, Sci-Fi]"
4,tt0093119,Grizzly II: Revenge,2020.0,74,"Horror,Music,Thriller","[Horror, Music, Thriller]"
...,...,...,...,...,...,...
79243,tt9914942,Life Without Sara Amat,2019.0,74,Drama,[Drama]
79244,tt9915872,The Last White Witch,2019.0,97,"Comedy,Drama,Fantasy","[Comedy, Drama, Fantasy]"
79245,tt9916170,The Rehearsal,2019.0,51,Drama,[Drama]
79246,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller","[Action, Adventure, Thriller]"
79247,tt9916362,Coven,2020.0,92,"Drama,History","[Drama, History]"

In [11]:
## Explode the dataframe to make each genre into a separate row
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,primaryTitle,startYear,runtimeMinutes,genres,genres_split
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,Kate & Leopold,2001.0,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70,Drama,Drama
2,tt0069049,The Other Side of the Wind,2018.0,122,Drama,Drama
...,...,...,...,...,...,...
79246,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller",Action
79246,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller",Adventure
79246,tt9916190,Safeguard,2020.0,90,"Action,Adventure,Thriller",Thriller
79247,tt9916362,Coven,2020.0,92,"Drama,History",Drama
79247,tt9916362,Coven,2020.0,92,"Drama,History",History

#### Create title_genres Table - title_genres
tconst: GenreID

In [12]:
## Save just tconst and genres_split as new df
title_genres = exploded_genres[['tconst','genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

#### Replacing Text Genres with Integer IDs

In [13]:
## Getting unique list of genres
unique_genres = sorted(title_genres['genres_split'].unique())
unique_genres

['Action',
 'Adult',
 'Adventure',
 'Animation',
 'Biography',
 'Comedy',
 'Crime',
 'Drama',
 'Family',
 'Fantasy',
 'Game-Show',
 'History',
 'Horror',
 'Music',
 'Musical',
 'Mystery',
 'News',
 'Reality-TV',
 'Romance',
 'Sci-Fi',
 'Short',
 'Sport',
 'Talk-Show',
 'Thriller',
 'War',
 'Western']

In [14]:
## Make a dictionary with list of unique genres as the key and the new iteger id as vlaues
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

#### Replacing Values in title_genres Table with Genre ID

In [15]:
## Use .map or .replace with our genre_id_map dictionary
title_genres['Genre_ID'] = title_genres['genres_split'].replace(genre_id_map)

## Drop the original genre column
title_genres.drop(columns=['genres_split'],inplace=True)
title_genres

          tconst  Genre_ID
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
79246  tt9916190         0
79246  tt9916190         2
79246  tt9916190        23
79247  tt9916362         7
79247  tt9916362        11

[148121 rows x 2 columns]

#### Create `genres` table
- Genre : Genre_ID

In [16]:
## Manaully make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                             'Genre_ID':genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [17]:
## Dropping original genre columns 
basics = basics.drop(columns=['genres','genres_split'])
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74
...,...,...,...,...
79243,tt9914942,Life Without Sara Amat,2019.0,74
79244,tt9915872,The Last White Witch,2019.0,97
79245,tt9916170,The Rehearsal,2019.0,51
79246,tt9916190,Safeguard,2020.0,90
79247,tt9916362,Coven,2020.0,92

# LOAD

## Connect to MySQL

In [18]:
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy import create_engine
from sqlalchemy_utils import create_database, database_exists
from sqlalchemy.types import *

In [19]:
## Getting mysql server password
import json
with open('/Users/codingdojo/.secret/mysql.json') as f:
    login = json.load(f)

login.keys()

dict_keys(['user', 'password'])

In [20]:
## create a new movies database
connect_str = f"mysql+pymysql://{login['user']}:{login['password']}@localhost/movies"

In [21]:
## Check if database exists, if not, create it
if database_exists(connect_str) == False:
    print("Creating the database.")
    create_database(connect_str)
else:
    print('The database already exists.')

The database already exists.

In [22]:
## create engine
engine = create_engine(connect_str)

In [23]:
## Test your connection by checking for any tables that exist (there should be none at this point)
q = """SHOW TABLES;"""
tables = pd.read_sql(q, engine)
tables

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4    tmdb_data_aab
5    tmdb_data_mvp

### Saving`title_basics` to db

In [24]:
## saving text length
key_len = basics['tconst'].map(len).max()
title_len = basics['primaryTitle'].map(len).max()
key_len, title_len

(10, 242)

In [25]:
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'runtimeMinutes':Integer()
    }
basics_schema

{'tconst': String(length=11),
 'primaryTitle': Text(length=243),
 'startYear': Float(),
 'runtimeMinutes': Integer()}

In [26]:
basics

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74
...,...,...,...,...
79243,tt9914942,Life Without Sara Amat,2019.0,74
79244,tt9915872,The Last White Witch,2019.0,97
79245,tt9916170,The Rehearsal,2019.0,51
79246,tt9916190,Safeguard,2020.0,90
79247,tt9916362,Coven,2020.0,92

In [27]:
## Saving basics as table with schema,
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

## setting title basics as the primary key
engine.execute('ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);')

In [28]:
## query first rows 
q = """SELECT * FROM title_basics LIMIT 5"""
pd.read_sql(q,engine)

,tconst,primaryTitle,startYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0093119,Grizzly II: Revenge,2020.0,74

### Saving Genre Tables

#### Saving genre_lookup

In [29]:
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

In [30]:
## Primary key is Genre_ID
genre_lookup.to_sql('genres',engine,index=False, if_exists='replace')

engine.execute('ALTER TABLE genres ADD PRIMARY KEY (`Genre_ID`);')

In [31]:
q = """SELECT * FROM genres LIMIT 5"""
pd.read_sql(q,engine)

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

#### Saving `title_genres` table

In [32]:
## NO PRIMARY KEY - DUPLCIATE VALUES
title_genres.to_sql('title_genres',engine,index=False,
                    if_exists='replace' )

# engine.execute('ALTER TABLE title_genres ADD PRIMARY KEY (`tconst`);')

In [33]:
q = """SELECT * FROM title_genres LIMIT 5"""
pd.read_sql(q,engine)

      tconst  Genre_ID
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

### Saving `title_ratings`

In [34]:
ratings_schema = {'tconst':String(key_len+1), 
                 'averageRating':Float(),
                 'numVotes':Integer()}#get_schema(ratings)
ratings_schema

{'tconst': String(length=11), 'averageRating': Float(), 'numVotes': Integer()}

In [35]:
ratings.to_sql('title_ratings',engine,if_exists='replace',index=False,
              dtype=ratings_schema)
engine.execute("ALTER TABLE title_ratings ADD PRIMARY KEY (`tconst`)")

In [36]:
q = """SELECT * FROM title_ratings LIMIT 5"""
pd.read_sql(q,engine)

      tconst  averageRating  numVotes
0  tt0000001            5.7      1879
1  tt0000002            5.9       248
2  tt0000005            6.2      2476
3  tt0000006            5.2       165
4  tt0000007            5.4       771

### Saving TMDB API Data

In [37]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 60130 entries, 1 to 1265
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                60130 non-null  object
 1   adult                  60130 non-null  float64
 2   backdrop_path          36994 non-null  object
 3   belongs_to_collection  3738 non-null   object
 4   budget                 60130 non-null  float64
 5   genres                 60130 non-null  object
 6   homepage               14776 non-null  object
 7   id                     60130 non-null  float64
 8   original_language      60130 non-null  object
 9   original_title         60130 non-null  object
 10  overview               58761 non-null  object
 11  popularity             60130 non-null  float64
 12  poster_path            54382 non-null  object
 13  production_companies   60130 non-null  object
 14  production_countries   60130 non-null  object
 15  release_date           59078 non-null  object
 16  revenue                60130 non-null  float64
 17  runtime                59298 non-null  float64
 18  spoken_languages       60130 non-null  object
 19  status                 60130 non-null  object
 20  tagline                22079 non-null  object
 21  title                  60130 non-null  object
 22  video                  60130 non-null  float64
 23  vote_average           60130 non-null  float64
 24  vote_count             60130 non-null  float64
 25  certification          14624 non-null  object
dtypes: float64(9), object(17)
memory usage: 12.4+ MB

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0144280,0.0,NaN,NaN,100000.0,[],NaN,30356.0,en,Whispers from a Shallow Grave,"When a beautiful photo model disappears, polic...",1.176,/cjRqAh3u2Z0MBx9GtT1k7Z9732w.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",1997-01-01,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Whispers from a Shallow Grave,0.0,2.0,2.0,NaN
2,tt0197633,0.0,/1hGrzTajJ5JC6VfPzrUj8Gj5t5k.jpg,NaN,0.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,58520.0,en,Live Freaky Die Freaky,It is the year 3069 and the Earth has been rob...,3.131,/3QKPZ9SzMcBdqkKdSitQbmRqB2l.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",2006-01-31,0.0,75.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Live Freaky Die Freaky,0.0,3.8,8.0,NR
3,tt0204250,0.0,/qKiOZMJH9Riqlk2SkUOgSMZHHJu.jpg,NaN,0.0,"[{'id': 9648, 'name': 'Mystery'}, {'id': 35, '...",NaN,459563.0,en,Death of a Saleswoman,Top-ranking RubberTubber saleswoman Agatha J. ...,0.600,/tIfllOpkhZl5sbqZd1X77iiaJDj.jpg,"[{'id': 90905, 'logo_path': None, 'name': 'Gir...","[{'iso_3166_1': 'US', 'name': 'United States o...",2006-09-18,0.0,77.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,6 housewives. 1 dead body. A trunk full of pla...,Death of a Saleswoman,0.0,3.0,1.0,NaN
4,tt0206634,0.0,/z8FzomPxfCb2nv827VWLSI6oYiB.jpg,NaN,76000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",http://www.universalstudiosentertainment.com/c...,9693.0,en,Children of Men,"In 2027, in a chaotic world in which humans ca...",19.318,/k9IAS4TehZFcKi4HVByxZNPfqex.jpg,"[{'id': 33, 'logo_path': '/8lvHyhjr8oUKOOy2dKX...","[{'iso_3166_1': 'GB', 'name': 'United Kingdom'...",2006-09-22,70595464.0,109.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The future's a thing of the past.,Children of Men,0.0,7.6,5779.0,R
5,tt0244521,0.0,/4W53mm2nvOtiOuPNW2oiBm9pmUZ.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 80, 'nam...",NaN,9925.0,en,Funny Money,"Henry Perkins, a mild-mannered accountant, acc...",5.591,/oG3jWUZiDqqrdk3oKwPEkuwoN89.jpg,"[{'id': 110622, 'logo_path': None, 'name': 'FW...","[{'iso_3166_1': 'DE', 'name': 'Germany'}, {'is...",2006-01-01,0.0,98.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Henry Perkins accidentally trades briefcases w...,Funny Money,0.0,5.4,39.0,R

### Instructor Note: Saving 2 versions of API data: MVP and AAB

In [38]:
## Keeping some columns
cols_to_keep = ['imdb_id','budget','revenue','certification',
                'original_language']
mvp = df[cols_to_keep]
mvp

        imdb_id      budget     revenue certification original_language
1     tt0144280    100000.0         0.0           NaN                en
2     tt0197633         0.0         0.0            NR                en
3     tt0204250         0.0         0.0           NaN                en
4     tt0206634  76000000.0  70595464.0             R                en
5     tt0244521         0.0         0.0             R                en
...         ...         ...         ...           ...               ...
1261  tt5896628         0.0         0.0           NaN                en
1262  tt6066786         0.0         0.0             G                en
1263  tt6188222         0.0         0.0           NaN                cn
1264  tt7246872         0.0         0.0           NaN                en
1265  tt9641790       400.0         0.0           NaN                en

[60130 rows x 5 columns]

In [39]:
mvp.isna().sum()

imdb_id                  0
budget                   0
revenue                  0
certification        45506
original_language        0
dtype: int64

In [40]:
mvp

        imdb_id      budget     revenue certification original_language
1     tt0144280    100000.0         0.0           NaN                en
2     tt0197633         0.0         0.0            NR                en
3     tt0204250         0.0         0.0           NaN                en
4     tt0206634  76000000.0  70595464.0             R                en
5     tt0244521         0.0         0.0             R                en
...         ...         ...         ...           ...               ...
1261  tt5896628         0.0         0.0           NaN                en
1262  tt6066786         0.0         0.0             G                en
1263  tt6188222         0.0         0.0           NaN                cn
1264  tt7246872         0.0         0.0           NaN                en
1265  tt9641790       400.0         0.0           NaN                en

[60130 rows x 5 columns]

In [41]:
## saving text length
key_len = mvp['imdb_id'].map(len).max()
cert_len = mvp['certification'].fillna('').map(len).max()
lang_len = mvp['original_language'].map(len).max()

key_len, cert_len,lang_len

(10, 31, 2)

In [42]:
## saving schema
api_data_schema = {'imdb_id':String(key_len+1), 
                 'budget':Float(),
                   'revenue':Float(),
                 'certification':Text(cert_len+1),
                  'original_language':Text(lang_len+1)}
api_data_schema

{'imdb_id': String(length=11),
 'budget': Float(),
 'revenue': Float(),
 'certification': Text(length=32),
 'original_language': Text(length=3)}

In [43]:
# saving mvp version
## Primary key is Genre_ID
mvp.to_sql('tmdb_data_mvp',engine, index=False,dtype=api_data_schema, if_exists='replace')

engine.execute('ALTER TABLE tmdb_data_mvp ADD PRIMARY KEY (`imdb_id`);')

In [44]:
q = """SELECT * FROM tmdb_data_mvp LIMIT 5"""
pd.read_sql(q,engine)

     imdb_id      budget     revenue certification original_language
0  tt0035423  48000000.0  76019000.0         PG-13                en
1  tt0062336         0.0         0.0          None                es
2  tt0069049  12000000.0         0.0             R                en
3  tt0088751    350000.0         0.0          None                en
4  tt0093119   7500000.0         0.0          None                en

In [45]:
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,overview,popularity,poster_path,production_companies,production_countries,release_date,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0144280,0.0,NaN,NaN,100000.0,[],NaN,30356.0,en,Whispers from a Shallow Grave,"When a beautiful photo model disappears, polic...",1.176,/cjRqAh3u2Z0MBx9GtT1k7Z9732w.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",1997-01-01,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Whispers from a Shallow Grave,0.0,2.0,2.0,NaN
2,tt0197633,0.0,/1hGrzTajJ5JC6VfPzrUj8Gj5t5k.jpg,NaN,0.0,"[{'id': 16, 'name': 'Animation'}, {'id': 35, '...",NaN,58520.0,en,Live Freaky Die Freaky,It is the year 3069 and the Earth has been rob...,3.131,/3QKPZ9SzMcBdqkKdSitQbmRqB2l.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",2006-01-31,0.0,75.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,Live Freaky Die Freaky,0.0,3.8,8.0,NR
3,tt0204250,0.0,/qKiOZMJH9Riqlk2SkUOgSMZHHJu.jpg,NaN,0.0,"[{'id': 9648, 'name': 'Mystery'}, {'id': 35, '...",NaN,459563.0,en,Death of a Saleswoman,Top-ranking RubberTubber saleswoman Agatha J. ...,0.600,/tIfllOpkhZl5sbqZd1X77iiaJDj.jpg,"[{'id': 90905, 'logo_path': None, 'name': 'Gir...","[{'iso_3166_1': 'US', 'name': 'United States o...",2006-09-18,0.0,77.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,6 housewives. 1 dead body. A trunk full of pla...,Death of a Saleswoman,0.0,3.0,1.0,NaN
4,tt0206634,0.0,/z8FzomPxfCb2nv827VWLSI6oYiB.jpg,NaN,76000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 28, 'name...",http://www.universalstudiosentertainment.com/c...,9693.0,en,Children of Men,"In 2027, in a chaotic world in which humans ca...",19.318,/k9IAS4TehZFcKi4HVByxZNPfqex.jpg,"[{'id': 33, 'logo_path': '/8lvHyhjr8oUKOOy2dKX...","[{'iso_3166_1': 'GB', 'name': 'United Kingdom'...",2006-09-22,70595464.0,109.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The future's a thing of the past.,Children of Men,0.0,7.6,5779.0,R
5,tt0244521,0.0,/4W53mm2nvOtiOuPNW2oiBm9pmUZ.jpg,NaN,0.0,"[{'id': 35, 'name': 'Comedy'}, {'id': 80, 'nam...",NaN,9925.0,en,Funny Money,"Henry Perkins, a mild-mannered accountant, acc...",5.591,/oG3jWUZiDqqrdk3oKwPEkuwoN89.jpg,"[{'id': 110622, 'logo_path': None, 'name': 'FW...","[{'iso_3166_1': 'DE', 'name': 'Germany'}, {'is...",2006-01-01,0.0,98.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,Henry Perkins accidentally trades briefcases w...,Funny Money,0.0,5.4,39.0,R

In [46]:
# # saving AAB version
# ## Primary key is Genre_ID
# df.to_sql('tmdb_data_aab',engine, index=False,dtype=api_data_schema, if_exists='replace')
# engine.execute('ALTER TABLE tmdb_data_aab ADD PRIMARY KEY (`imdb_id`);')

### Troubleshoot: Error with AAB Version

- Error when trying to save AAB version. 
- Built a recursive feature addition loop to try adding more and more columns before running command that error'd.
- Used function to programmatically make new schema each time (thinking the schema was part of the issue - but it may have been fine).

In [47]:
def get_schema(table,debug=False):
    ## save pandas dtypes in list, make empty dict
    dtypes = table.dtypes
    schema = {}
    
    # for each column
    for col in dtypes.index:
        ## print info if in debug mode
        if debug:
            print(f"{col} = {dtypes.loc[col]}")

        ## if its a string column (object)
        if dtypes.loc[col]=='object':
            
            ## Fill null values and make sure whole column is str
            data = table[col].fillna('').astype(str)
            
            ## get len first
            len_str = data.map(len).max()
            
            ## if the string is shorter than 21845 use String
            # (forget how i knew it was max size)
            if len_str < 21845:
                schema[col] = String( len_str + 1)
                
            ## If longer use Text
            else:
                schema[col] = Text(len_str+1)
        
        # if float make Float
        elif dtypes.loc[col] == 'float':
            schema[col] = Float()

        ## if int make Integer
        elif dtypes.loc[col] == 'int':
            schema[col] = Integer()
            
        ## if bool make Boolean
        elif dtypes.loc[col] == 'bool':
            schema[col] = Boolean()
            
    return schema

In [ ]:
## loop through adding more columns and remove what errors
good_cols = [*cols_to_keep]
bad_cols = []
all_cols = df.drop(columns=cols_to_keep).columns

for col in all_cols:
    print(f"- Adding {col}")
    try: 
        cols_to_try = [*good_cols, col]
        df_filtered = df[ cols_to_try]
        schema= get_schema(df_filtered)
        ## Primary key is Genre_ID
        df_filtered.to_sql('tmdb_data_aab',engine, index=False,
                           dtype=schema, if_exists='replace')
        
        # append col name to good_cols if no error
        good_cols.append(col)
    except Exception as e:
#         print(e)
        bad_cols.append(col)
bad_cols

In [51]:
engine.execute('ALTER TABLE tmdb_data_aab ADD PRIMARY KEY (`imdb_id`);')

In [52]:
q = """SELECT * FROM tmdb_data_aab LIMIT 5"""
pd.read_sql(q,engine)

,imdb_id,budget,revenue,certification,original_language,adult,backdrop_path,belongs_to_collection,genres,homepage,id,overview,popularity,poster_path,production_companies,production_countries,release_date,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count
0,tt0035423,48000000.0,76019000.0,PG-13,en,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,None,"[{'id': 35, 'name': 'Comedy'}, {'id': 14, 'nam...",None,11232.0,When her scientist ex-boyfriend discovers a po...,12.012,/mUvikzKJJSg9khrVdxK8kg3TMHA.jpg,"[{'id': 85, 'logo_path': None, 'name': 'Konrad...","[{'iso_3166_1': 'US', 'name': 'United States o...",2001-12-25,118.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,If they lived in the same century they'd be pe...,Kate & Leopold,0.0,6.3,1106.0
1,tt0062336,0.0,0.0,None,es,0.0,/fw5tsNib4QZBEw18xmebpVe3WZ8.jpg,None,"[{'id': 18, 'name': 'Drama'}, {'id': 14, 'name...",http://poetastros.com/el-tango-del-viudo/,602986.0,"A man whose wife has committed suicide, appea...",1.400,/yzbqP9woGq2wGUJh0DzVXlr3Th7.jpg,"[{'id': 96241, 'logo_path': None, 'name': 'Poe...","[{'iso_3166_1': 'CL', 'name': 'Chile'}]",2020-02-21,63.0,"[{'english_name': 'Spanish', 'iso_639_1': 'es'...",Released,None,The Tango of the Widower and Its Distorting Mi...,0.0,5.3,3.0
2,tt0069049,12000000.0,0.0,R,en,0.0,/zjG95oDnBcFKMPgBEmmuNVOMC90.jpg,None,"[{'id': 18, 'name': 'Drama'}]",https://www.netflix.com/title/80085566,299782.0,"Surrounded by fans and skeptics, grizzled dire...",8.769,/kFky1paYEfHxfCYByEc9g7gn6Zk.jpg,"[{'id': 36547, 'logo_path': None, 'name': 'SAC...","[{'iso_3166_1': 'FR', 'name': 'France'}, {'iso...",2018-11-02,122.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,40 years in the making,The Other Side of the Wind,0.0,6.7,155.0
3,tt0088751,350000.0,0.0,None,en,0.0,None,None,"[{'id': 35, 'name': 'Comedy'}, {'id': 27, 'nam...",None,29163.0,Using soundtracks and extensive footage from m...,3.411,/aYbeNeNID1wLBp9l214w8CU00xd.jpg,[],"[{'iso_3166_1': 'US', 'name': 'United States o...",2005-04-22,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,None,The Naked Monster,0.0,3.4,5.0
4,tt0093119,7500000.0,0.0,None,en,0.0,/2rGYlO0x9HFHyDmTlICGUj51AIJ.jpg,"{'id': 528034, 'name': 'Grizzly Collection', '...","[{'id': 27, 'name': 'Horror'}, {'id': 10402, '...",None,38258.0,"All hell breaks loose when a giant grizzly, re...",9.893,/dKHoRIicgHLoNPKiRJpRPHd96Gx.jpg,"[{'id': 53282, 'logo_path': None, 'name': 'Har...","[{'iso_3166_1': 'US', 'name': 'United States o...",2020-02-17,74.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,The Stage Is Set... And The Dinner Is Served.,Grizzly II: Revenge,0.0,4.6,12.0

# Final Tables Check

In [53]:
## Test your connection by checking for any tables that exist (there should be none at this point)
q = """SHOW TABLES;"""
pd.read_sql(q, engine)

  Tables_in_movies
0           genres
1     title_basics
2     title_genres
3    title_ratings
4    tmdb_data_aab
5    tmdb_data_mvp